# Cours initiation au machine learning avec pandas/ Traitement de fichier avec pandas

## I. IMPORTATION DU DATAFRAME

In [2]:
# Importation du module pandas
import pandas as pd

In [3]:
# Importation du dataframe depuis la documentation de pandas
df = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/main/doc/data/titanic.csv', sep=',')
print("Les 10 premières lignes sont : ")
df.head(3)

Les 10 premières lignes sont :

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [9]:
#☻ les types de données
print("Les types de données sont :")
df.dtypes

Les types de données sont :

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [10]:
# Affichage des informations sur les données du dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [13]:
# Affichage des dernières ligne du fichiers, par défaut 5 lignes
print("Les 5 dernières lignes soont :")
df.tail()

Les 5 dernières lignes soont :

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [14]:
# Nombre de lignes et colonnes du dataframe
print("Le nombre de lignes est :", df.shape[0])
print("Le nombre de colonnes est :", df.shape[1])

Le nombre de lignes est : 891
Le nombre de colonnes est : 12

In [15]:
# Conversion du fichier csv en fichier excel
# Pour cela il faut installer le package openpyxl pour le traitement des fichiers excel
# Importation du module openpyxl
import openpyxl
df.to_excel("convert.xlsx", sheet_name="passager", index=False)

In [ ]:
# Attribution d'une nouvelle variable au nouveau fichier excel
new_file = pd.read_excel("convert.xlsx", sheet_name="passager")
# sauvegarder dans le fichier convert.xlsx
# Affichage des 5 premières lignes du fichier excel
new_file.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#  II. Selection de sous ensemble d'un dataframe

1. Dans cette partie nous allons nous intéressé à certaines colonnes uniquement de notre dataframe
- Avec toujours les données du Titanic disponoble sur la documentation de pandas

In [20]:
# Nous voulons nous intéressé a la colonne Age de notre dataframe

# d'abord on declare une variable(ici: ages)

ages = df["Age"]
# Affichage de quelques lignes de la variable ages
print("Quelques lignes de la variable ages sont : \n", ages.head())
print("\n")
print("Le type de données de la variable ages est : ", ages.dtypes)
print("\n")
print("Le nombre de ligne total de la variable age est :", ages.shape[0])

Quelques lignes de la variable ages sont :
 0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64


Le type de données de la variable ages est :  float64


Le nombre de ligne total de la variable age est : 891

In [30]:
# Maintenant nous allons nous intéresser à la variable age et sexe
age_sex = df[["Age" , "Sex"]]
# Si vous voulez cibler des colonnes spécifiques, vous devez utiliser les doubles crochets [[]] et y listé les colonnes (comme ci-dessus)
print("Quelques lignes : ")
age_sex.head()

Quelques lignes :

    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

# Filtrage des lignes spécifiques dans un dataframe
- Suppons que dans votre dataframe, vous avez la variable age avec differentes age et vous avez bésoin que d'une tranche d'âge.
cette partie vous permettra de faire cette manipulation

In [39]:
# Je sui intéressé par les personnes de plus de 35 ans
# Vous pouvez utiliser les opérations de comparaison au milieu des crochets
age_sup_35 = df[df["Age"]> 35]
age_sup_35.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S

In [43]:
# Nombre de ligne et colonne
print(f"Nous avons {age_sup_35.shape[0]} lignes de plus de 35 ans et {age_sup_35.shape[1]} colonnes")

Nous avons 217 lignes de plus de 35 ans et 12 colonnes

In [ ]:
# Filtrage des lignes dont l'âge est supérieur à 35, ce qui renvoie une série de booléens
df["Age"] > 35

0      False
1       True
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool